# Mengenal explode dan implode List pada Pandas Data Frame

### Import Modul dan Cek Versi

In [1]:
import pandas as pd
print(pd.__version__)

1.3.4

### Persiapan Data Frame

In [3]:
d = {'Team':['DC', 'Marvel'],
            'Heroes':[['Batman', 'Superman', 'Wonder Woman', 'Aquaman', 'Green Lantern', 'Shazam'],
                     ['Iron Man', 'Captain America', 'Ant-Man', 'Black Panther', 'Captain Marvel']]}

df = pd.DataFrame(d)
df

     Team                                             Heroes
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...

# Explode

Berfungsi untuk memisahkan item dalam list menjadi baris terpisah

In [4]:
df1 = df.explode('Heroes')
df1

     Team           Heroes
0      DC           Batman
0      DC         Superman
0      DC     Wonder Woman
0      DC          Aquaman
0      DC    Green Lantern
0      DC           Shazam
1  Marvel         Iron Man
1  Marvel  Captain America
1  Marvel          Ant-Man
1  Marvel    Black Panther
1  Marvel   Captain Marvel

# Implode

Berfungsi untuk menyatukan kembali beberapa baris menjadi satu list

In [7]:
d = {'Team' : ['DC', 'Marvel']}
df2 = pd.DataFrame(d)
df2

     Team
0      DC
1  Marvel

In [8]:
df2['Imploded'] = df1.groupby(df1.index)['Heroes'].agg(list)
df2

     Team                                           Imploded
0      DC  [Batman, Superman, Wonder Woman, Aquaman, Gree...
1  Marvel  [Iron Man, Captain America, Ant-Man, Black Pan...